modm-ext/archive-stmicro-svd/header_stm32g473cbt3.svd
      <register>
        <name>SR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1IF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2IF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3IF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4IF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMIF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TIF</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BIF</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>B2IF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1OF</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2OF</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3OF</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4OF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBIF</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC5IF</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC6IF</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IDXF</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DIRF</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IERRF</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERRF</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EGR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UG</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1G</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2G</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3G</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4G</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMG</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TG</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BG</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>B2G</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCMR1</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CC1S</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC1FE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1PE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC1M</name>
            <bitOffset>4</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC1CE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2S</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC2FE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2PE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC2M</name>
            <bitOffset>12</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC2CE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCMR2</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CC3S</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC3FE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3PE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC3M</name>
            <bitOffset>4</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC3CE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4S</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OC4FE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC4PE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC4M</name>
            <bitOffset>12</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC4CE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCER</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CC1E</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1P</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1NE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC1NP</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2E</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2P</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2NE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC2NP</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3E</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3P</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3NE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC3NP</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4E</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4P</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4NE</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC4NP</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC5E</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC5P</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC6E</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CC6P</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>UIFCPY</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PSC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ARR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ARR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RCR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>REP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR2</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR3</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR3</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BDTR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DTG</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSSI</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OSSR</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKE</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKP</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AOE</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MOE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKF</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BK2F</name>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BK2E</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BK2P</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKDSRM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BK2DSRM</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKBID</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BK2BID</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR5</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>GC5C1</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GC5C2</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GC5C3</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR6</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CCR6</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCMR3</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OC5FE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC5PE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC5M</name>
            <bitOffset>4</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC5CE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC6FE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC6PE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OC6M</name>
            <bitOffset>12</bitOffset>
            <bitWidth>13</bitWidth>
          </field>
          <field>
            <name>OC6CE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DTR2</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DTGF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DTAE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DTPE</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ECR</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>IE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IDIR</name>
            <bitOffset>1</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>FIDX</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IPOS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PW</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>PWPRSC</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TISEL</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TI1SEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TI2SEL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TI3SEL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>TI4SEL</name>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AF1</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AF2</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OR</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HSE32EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DCR</name>
        <addressOffset>0x3dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DBA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DBL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMAR</name>
        <addressOffset>0x3e0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <baseAddress>0x40013000</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CPHA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CPOL</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTR</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BR</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SPE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LSBFIRST</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSI</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SSM</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXONLY</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCL</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCNEXT</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRCEN</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BIDIOE</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BIDIMODE</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
